Repository: DirtGamer301/rigsofrods.github.io
Catalog: blog/po/*/blog/2015-06-07-devblog-progress-report-05-2015/index.adoc.po
Languages: ru

source: DevBlog: Progress report 05/2015
ru: Отчёт о разработке за май 2015

source: *Hello RoR fans!*
ru: *Привет фанатам RoR!*

source: Late as usual, I bring you an overview of development done during May.
ru: Хоть и с опозданием, но публикуем обзор разработки RoR за май.

source: The project
ru: Оргвопросы

source: I'm happy to state RoR has a healthy link:https://github.com/RigsOfRods/rigs-of-rods/pulse[pulse]. The GitHub repository is greatly helping our development. The issue tracker is receiving a lot of submissions from users testing our latest builds, and the dev team does their best to attend to and resolve them. We're also receiving stars and attracting new contributors.
ru: Рад сказать, что у проекта здоровый link:https://github.com/RigsOfRods/rigs-of-rods/pulse[пульс]. Это заслуга нашего центра разработки на GitHub. Багтрекер ежедневно пополняется вашими отчётами, а мы, в свою очередь, исправляем ошибки по мере сил. Кроме того, ваши лайки на GitHub дают проекту видимость и новых разработчиков.

source: Hiradur worked hard to set up link:https://travis-ci.org/RigsOfRods/rigs-of-rods[Travis CI] for RoR. It's a continuous integration service - it builts RoR regularily under linux to see if build passes OK. This is very important for us since we maintain both windows and linux compatibility, and from time to time, some windows contributions (ahem, mine...) break linux build.
ru: Hiradur настроил для нас тестирование на link:https://travis-ci.org/RigsOfRods/rigs-of-rods[Travis CI]. Это сервис постоянной интеграции - он собирает RoR под Linux и выводит ошибки при неудаче. Это особенно важно т.к. ваш покорный слуга пишет и тестирует RoR только под Windows, хотя кросс-платформенность - краеугольный камень разработки.

source: Max98 had a great idea to set up link:https://gitter.im/RigsOfRods/rigs-of-rods[Gitter] discussion board for RoR. Gitter is a browser based chat service directly linked to our repository. Great place for developers to meet each other and other community members to talk about technical aspects of RoR. And, it's already attracting new people who may contribute important knowledge to the project.
ru: Max98 создал link:https://gitter.im/RigsOfRods/rigs-of-rods[комнату на Gitter]: чат-сервисе, привязанном к хранилищам на GitHub. Отличное место для встречи разработчиков RoR и обсуждения всех технических вопросов. Она сама по себе привлекает новых людей, готовых внести вклад в разработку игры.

source: It's still in development, there's still no release date and the purpose has slowly and silently changed. Original plan was to only make RoR stable, content-compatible and crash-free while ignoring performance and not adding any features. However, volunteer-based development progresses slowly and players are equally concerned about performance, stability, graphics, performance and gameplay experience as a whole. And yes, I know I wrote "performance" twice. So, the new motto of 0.4.5 is "All kinds of improvements, as long as nothing gets broken and it runs at least a little faster than before".
ru: Новая версия всё ещё в разработке, сроков пока нет, а планы немного изменились. Сначала мы лишь хотели исправить текущие ошибки, "стабилизировать" код и выпустить 0.4.5. Однако разработка идёт медленно (мы все добровольцы, пишем игру в свободное время), а для игроков важно всё: скорость, стабильность, графика, скорость, геймплей в целом. Да, я упомянул слово "скорость" дважды. По этой причине новый слоган версии 0.4.5: "Любые улучшения, ничего не ломающие и не тормозящие движок".

source: The fix of the month are definitely FlexBodies. Somewhere between 0.39 and 0.4.0x they became malformed, as reported in link:https://github.com/RigsOfRods/rigs-of-rods/issues/16[this issue]. In test build 3, they are corrrect again and faster than before, thanks to Max98.
ru: Исправление месяца - безусловно, мягкие тела. Где-то по дороге к 0.4.0x их сломали (см. link:https://github.com/RigsOfRods/rigs-of-rods/issues/16[отчёт об ошибке]). Исправлены и ускорены в тестовой сборке 3, спасибо Max98.

source: Another improvement is speed of vehicle loading. During testing, I got angry about vehicles taking too long to load, so I incorporated a tiny link:https://floodyberry.wordpress.com/2009/10/07/high-performance-cplusplus-profiling[profiler] into the codebase and started investigating. The major bottleneck were verbose logs I added to the spawn process. I added config options for them and made them disabled by default. Next, it got interesting - the bottleneck were FlexBodies, but curiously, not their generation, but finding LOD files in OGRE's resource system (which is super slow and targeted for elimination by OGRE team, btw). Since link:http://www.rigsofrods.com/threads/119482-Flexbodies-LODs-really[nobody seems to use the feature], I added config option to disable it by default. Next bottleneck was flexbody generation itself and I found a way to bypass even that - I added a cache support to flexbodies, so they are only generated once and saved as binary file to cache, subseqent spawns load it from the cache. Right now the feature is disabled by default, see file /resources/skeleton/conf/README.txt for instructions how to enable and test it. I have to say I'm quite proud of this improvement and I'm planning to use it in more areas of RoR to speed up loading even further.
ru: Далее, скорость загрузки транспорта. Терпеть такие тормоза при загрузке ТС выше моих сил, поэтому для диагностики был встроен link:https://floodyberry.wordpress.com/2009/10/07/high-performance-cplusplus-profiling[профилировщик]. Затыком оказались подробные логи, после чего я сделал их настраиваемыми и выключил по умолчанию. Дальше больше. Обнаружились тормоза, связанные с мягкими телами, но не их генерацией, а поиском LOD-файлов в ресурсной системе OGRE (супер-тормознутой - кандидат на вылет из движка). Эту link:http://www.rigsofrods.com/threads/119482-Flexbodies-LODs-really[лишнюю] опцию теперь можно отключить по умолчанию. Наконец, узким местом оказалась сама генерация мягких тел, но удалось обойти и его - я добавил кэширование, благодаря которому мягкие тела создаются лишь при первой загрузке ТС. При дальнейшей загрузке того же транспорта загружается готовый двоичный файл из кэша. Сейчас данная опция отключена по умолчанию, см. инструкции по использованию в /resources/skeleton/conf/README.txt. Скажу вам, я горжусь данным улучшением и планирую использовать его для оптимизации загрузки других частей RoR в дальнейшем.

source: The future
ru: Будущее

source: I've done enough dreaming in the last devblog post. Now I'm back to the boring but necessary fixing of vehicle/map compatibility. Current work: fixed objects on maps. But I can't resist the urge to slowly enhance the rig editor as well. Current work: flares. And finally, I also began attending to performance issues. Current work: adding a performance graph window to help pinpoint the bottleneck on various player hardware. This makes the development somewhat fuzzy and unfocused, but it's the best answer to the requests from the community.
ru: Для мечтаний хватило прошлого блога, настало время фиксить баги. А именно, совместимость карт и транспорта. В разработке: объекты на карте. Но не могу же я сопротивляться порывам работать над редактором ТС! В разработке: вспышки. Наконец, идёт работа и над производительностью. В разработке: график производительности для выявления узкких мест на различных конфигурациях ПК. Да, это размывает фокус разработки, но таковы запросы сообщества.

source: Have fun playing RoR!
ru: Приятной игры в RoR!
