Repository: DirtGamer301/rigsofrods.github.io
Catalog: blog/po/*/blog/2015-05-02-devblog-progress-report-04-2015/index.adoc.po
Languages: ru

source: title: "DevBlog: Progress report 04/2015"
ru: title: "Отчёт о разработке за апрель 2015"

source: firstname: "Petr"
ru: firstname: "Петр"

source: lastname: "Ohlídal"
ru: lastname: "Оглидал"

source: tags: ["Development"]
ru: tags: ["Разработка"]

source: DevBlog: Progress report 04/2015
ru: Отчёт о разработке за апрель 2015

source: *Hello RoR fans!*
ru: *Привет фанатам RoR!*

source: Another 2 months have passed and 1 new progress report is here! It turned out everyone (including me) was so busy in march that barely any development happenned and I had no time to write a blog post (plus, nothing new to write about, really). Fortunately, April has been much more relaxed and I've been able to do some very important progress. All of my latest changes are incorportated in http://rigsofrods.com/threads/119110[0.4.5.0-dev test build 2] - I encourage everyone to test!
ru: Прошло ещё 2 месяца, и вот - новый отчёт. Оказалось, что все (включая меня) были настолько заняты в марте, что разработка шла ни шатко ни валко, и у меня не было времени на написание девблога (да и не о чем). К счастью, апрель был гораздо более расслабленным, и я смог внести существенные улучшения. Все из моих последних изменений можно оценить в версии http://rigsofrods.com/threads/119110[0.4.5.0-dev, тестовой сборке 2] - поэтому я призываю всех скачать и присоединиться к тестированию!

source: Vehicle compatibility status
ru: Совместимость ТС

source: ...has improved! I tested with many more vehicles and I re-thought my approach to parser design. For one thing, I began loosening the very strict syntax checking which was causing vehicles to spawn crippled and littered the "spawner report" window with loads of warning messages. Very common mistakes, such as extra commas at the ends of lines, trailing comments (yes, they weren't legit), invalid flags and bad lettercase of keywords is now tolerated, often silently without warning message. Further, I began adding "fallback" method of parsing for lines which don't make it through the syntax check - in this case, parser will emit a warning and process the line by means of RoR v0.38/v0.4.0.7 - unsafe, but mostly workable. So far, "nodes/nodes2" were augumented this way.
ru: ...улучшена! По итогам тестирования многих транспортных средств, я переосмыслил подход к дизайну анализатора. Для начала я снизил требования к синтаксису, из-за которых ТС появлялись в нерабочем состоянии и засоряли окно "отчёта о появлении" предупреждениями. Частые ошибки (напр. лишние запятые на концах линий, хвостовые комментарии (да, они были запрещены), левые флаги и неправильный регистр ключевых слов) теперь допускаются, часто молча, без предупреждения. Кроме того, я начал добавлять "запасной" метод разбора для линий, которые не проходят проверку - в этом случае, анализатор выдаст предупреждение и обработает линию как RoR v0.38 / v0.4.0.7 - это небезопасно, но работоспособно. Пока таким образом доработаны "nodes / nodes2".

source: But most importantly, I changed my philosophical approach to processing the .truck format. From the very start, I knew that the parsing process used in 0.4.0.7 has to change, both to clear the way for further development of RoR's physics (the old parser was seriously blocking it), and also because I wanted to equip RoR with a built-in rig editor. However, at the same time, I needed to maintain compatibility with existing content. Until now, I've been trying to write a parser which would satisfy both requirements. It didn't really work, most vehicles got broken and I wasted a lot of words rambling about how bad was both the code and the truckfiles. But about a week ago, I finally concluded the parser I wrote suits my needs, but it will never fit together with existing content. After realizing this, it was obvious what I have to do: <<{baseurl}/docs/truck-description-file/index.adoc#fileformatversion,Declare a new fileformatversion>> for future content, and write an importer component for content with lower fileformatversion. For the new fileformatversion number, I chose "450", to resemble version number 0.4.5.0 and also to signify it works differently than older numbers (1,2,3) - those were just informational and the parser ignored them. My fileformatversion actually makes a big difference.
ru: Но самое главное - я изменил свой философский подход к обработке формата .truck. С самого начала я знал, что парсинг, используемый в 0.4.0.7, должен измениться, как для дальнейшего развития физики в RoR (а старый анализатор серьезно блокирует его), так и для включения в состав игры редактора ТС. В то же время, важно сохранить совместимость с существующим контентом. До сих пор, я пытался написать парсер, который удовлетворял бы обоим требованиям. Получилось криво, большинство ТС сломалось, а я начал плакаться о качестве как кода, так и truck-файлов. Наконец, неделю назад я пришёл к выводу, что парсер, который удовлетворяет моим потребностям, безнадёжно сломает совместимость с существующими ТС. Понимая это, очевидны и дальнейшие шаги: <<{baseurl}/docs/truck-description-file/index.adoc#fileformatversion,объявить новую версию формата>>, и написать конвертер для старой. Новая версия формата будет именоваться "450" (ибо для версии 0.4.5.0), а также для обозначения нового поколения после прежних (1,2,3). Если раньше версия формата с точки зрения анализатора была пустяком, то теперь при парсинге имеет огромное значение.

source: Nonetheless, I began bumping into prevailing v0.38 -> v0.4.0.7 incompatibilities, such as this one. Those will be harder to tackle because the code of version 0.38 is 4 years old and uses outdated dependencies, so it'll take some time to create a working dev version for testing and investigation. I'll try my best, but no promises at this point.
ru: Тем не менее, начали вылезать нестыковки v0.38 -> v0.4.0.7, например, эта. Их будет сложнее решать, потому что коду версии 0.38, на секундочку, 4 года и он основан на устаревших библиотеках, так что создание рабочей беты займёт некоторое время. Я буду стараться изо всех сил, но ничего обещать не могу.

source: Again, I encourage everyone to http://rigsofrods.com/threads/119110[download a test build and check his favourite vehicles]. They should work a lot better now.
ru: Опять же, я призываю всех http://rigsofrods.com/threads/119110[скачать тестовую сборку и проверить свои любимые автомобили]. Они должны работать намного лучше.

source: Rig editor status
ru: Редактор ТС

source: The editor is still not usable, but it's progressing steadily. This time, I added support for wheels (meshwheels2 + flexbodywheels so far). There's a selection menu in the top menubar and panels which can alter wheel parameters. Changes to wheel size or number of rays are displayed immediately and you can select + edit multiple wheels at the same time. There's also an option to create a new rig from scratch and the "engine" panel was equipped with [add engine]/[remove engine] buttons which were missing before. The N/B editing controls are still not complete (you can delete beams, but you can't add them yet), but work is being done. Further, the wheel-subsystem components (selection menu, highlight boxes, panels) were created as generic, so there will soon be similarly implemented support for flares, props, wings and more features.
ru: Редактор всё ещё не работает, но есть успехи в разработке. На этот раз я добавил поддержку колёс (на данный момент meshwheels2 + flexbodywheels). Там же меню выбора в верхней строке меню и панели, которые могут изменить параметры колеса. Изменения в размере колёс или числа лучей отображаются сразу, и вы можете выбрать + изменить несколько колёс одновременно. Также есть возможность создать новое ТС с нуля, а на панели "двигатель" теперь есть кнопки [добавить двигатель] / [удалить двигатель]. Инструменты редактирования узлов/рёбер по-прежнему не готовы (можно удалить рёбра, но пока нельзя добавить), но работа ведётся. Кроме того, компоненты колёсной подсистемы (меню выбора, поля выделения, панели) были созданы как общие, так что в ближайшее время будет аналогично реализована поддержка вспышек, винтов, крыльев и других функций.

source: Anyway, at this point, some of you may legitimately question my efforts to create the rig editor. Although it's a nice thing to have, it doesn't seem to be really needed, modders have been happily creating content using existing methods and without any apparent issues, as http://rigsofrods.com/threads/118966[this forum thread] shows. So, do I have good reason to burn a lot of time working on the editor when there are much more serious flaws to tackle? I believe so, and you deserve to know it.
ru: Во всяком случае, на данный момент, некоторые из вас могут законно сомневаться в моих усилиях по созданию редактора ТС. Хотя это полезная вещь, она, на первый взгляд, не является крайней необходимостью, поскольку моддеры годами создавали контент, используя существующие методы без каких-либо существенных проблем, http://rigsofrods.com/threads/118966[эта тема на форуме] тому подтверждение. Так а вообще есть ли смысл работать над редактором когда есть уйма более серьёзных проблем? Есть, и вам стоит его знать.

source: Physics of the future
ru: Физика будущего

source: Currently, RoR can handle roughly 500 nodes + 3000 beams per vehicle. With so few elements, it's reasonable to do this work manually. However, this system leaves a lot to be desired - the soft body physics model (with weighted nodes acting like joints + weightless beams + stability requirements) is very hard and unnatural for a human to work with. Also, the RoR handles only enough N/B to create a grid-like chassis where 3d models can be attached (props, flexbodies).
ru: Сейчас RoR может обрабатывать около 500 узлов + 3000 рёбер на каждое ТС. С таким небольшим числом элементов разумно моделировать ТС вручную. Тем не менее, эта система оставляет желать лучшего - человеку трудно работать с моделью мягких тел (с взвешенными узлами, действующими как суставы + невесомые рёбра + требования устойчивости) - она очень трудна и неестественна. Кроме того, RoR обрабатывает только столько У/Р сколько надо для создания сеточного кузова, к которому прикрепляются 3D-модели (винты, гибкие узлы).

source: Now imagine I created a completely new physics engine which could handle roughly *ten times more N/B* than the current engine (think *5 000 nodes* and *30 000 beams*). These numbers must sound insane to RoR veterans, but I have good technical reasons to believe such performance can be achieved. Further details aside, you'll agree with me that creating so detailed N/B by hand (or in Blender, or Editorizer, or any other similar method) will become humanly impossible. Further, such performance increase will deserve new approach to N/B architecture - instead of modelling a vehicle as a whole, it will be possible to model individual components (rigid frame, soft interior, heavy rigid engine, outer chassis components, possibly a rollcage) and then join them to create more reallistic deformation behavior.
ru: Теперь представьте себе, что мы создали совершенно новый физический движок, который может обрабатывать примерно в *10-раз больше У/Р* (например, *5 000 узлов* и *30 000 рёбер*). Думаете, эти цифры - бред сумасшедшего? У меня есть серьёзные технические основания полагать, что такая производительность достижима. Если отбросить детали, то мы понимаем, что создание настолько подробной У/Р вручную (или в Blender, или Editorizer или другим аналогичным методом) станет по-человечески невозможно. Кроме того, такое увеличение производительности повлечёт переход к новой архитектуре У/Р - от моделирования целой платформы мы перейдём к созданию отдельных деталей (жёсткая рама, мягкая обивка, тяжелый жесткий двигатель, внешние компоненты кузова, возможно, каркас безопасности), которые потом соединятся и будут иметь более реалистичное поведение при деформации.

source: There is only one way to deal with such a modding challenge - using a CAD-like editor where the vehicle can be modelled the way technical engineers do - by defining real-world shapes of components, materials and means of joining components together. The editor would then compute the best fit N/B to simulate such vehicle. And THAT is precisely where I'm headed in my rig-editor efforts. Currently, the editor has only partial support for hand-editing the N/B, but that's just something to start with and an utility for current modders + current content. But I'm really looking into the future, and the future is CAD.
ru: Существует только один способ справиться с таким вызовом - с помощью CAD-подобного редактора, где транспортное средство создаётся так, как это делают настоящие инженеры - путём определения реальных форм компонентов, материалов и средств соединения компонентов вместе. Редактор затем вычисляет наиболее пригодный У/Р, чтобы имитировать такой автомобиль. Именно это и есть нынешнее направление разработки редактора ТС. В настоящее время, конструктор имеет лишь частичную поддержку ручного редактирования У/Р, но это всего лишь начало, и кость для текущих моддеров + текущего контента. Но я с нетерпением смотрю в будущее, а будущее - за CAD.

source: Naturally, this is only an enthusiast project done in people's free time. It may not succeed. But I'll incorporate enough scripting support to spread the implementation complexity among members of the comunnity, so everything will be achievable. I'm optimistic.
ru: Конечно, это проект на голом энтузиазме, который я делаю в свободное от работы время. Он может провалиться. Но я включю поддержку сценариев, достаточную для распространения реализации среди членов сообщества, так что всё будет достижимо. Я настроен оптимистично.

source: Until then, please bear with me.
ru: А пока, не стреляйте в пианиста.
