Repository: DirtGamer301/rigsofrods.github.io
Catalog: blog/po/*/blog/2015-08-24-0.4.5.1-released/index.adoc.po
Languages: ru

source: title: "0.4.5.1 released!"
ru: title: "Релиз 0.4.5.1!"

source: firstname: "Artem"
ru: firstname: "Артём"

source: lastname: "Vorotnikov"
ru: lastname: "Воротников"

source: tags: ["Development", "Release"]
ru: tags: ["Разработка", "Релиз"]

source: 0.4.5.1 released!
ru: Релиз 0.4.5.1!

source: Hello folks
ru: Привет!

source: The dev team is happy to the first bugfix release of the 0.4.5 NextStable series. It contains several fixes that didn't make it to 0.4.5.0 in time or were discovered after NextStable release.
ru: Команда разработчиков рада сообщить о выпуске первой порции исправлений для ветки 0.4.5 NextStable. Она содержит изменения, которые не попали в 0.4.5.0 и которые исправляют баги, обнаруженные уже после релиза NextStable.

source: Changelog
ru: Список изменений

source: Fixed crash on driving through railway switches.
ru: Исправлено падение при пересечении ЖД-стрелок.

source: Added shadows support to more default models.
ru: Добавлены тени для ещё большего числа моделей.

source: Removed unneeded text from notice box.
ru: Убран лишний текст из окна оповещения.

source: Improved shadows quality.
ru: Улучшено качество теней

source: Updated textures.
ru: Обновлены текстуры.

source: Get it
ru: Скачать

source: Windows build can be downloaded from GitHub. Current RoR Windows playets can also use the updater shipped with 0.4.5 to upgrade.
ru: Сборку для Windows можно скачать с сайта GitHub. Нынешние игроки RoR на Windows также могут использовать программу обновления, которая поставляется с 0.4.5.

source: Linux users can use <<{baseurl}/docs/linux-scripts/index.adoc#,automated scripts>> to download and build the latest snapshot.
ru: Пользователи Linux могут использовать <<{baseurl}/docs/linux-scripts/index.adoc#,автоматические скрипты>> для загрузки и сборки последнего среза.

source: Thank you for playing Rigs of Rods and we hope you enjoy the NextStable release series.
ru: Спасибо за то что играешь в Rigs of Rods и надеемся, что ветка NextStable тебе понравится.
