Repository: DirtGamer301/rigsofrods.github.io
Catalog: content/po/*/docs/index.adoc.po
Languages: ru

source: Documentation index
ru: Документация

source: Thank you for installing Rigs of Rods! We have created this set of documentation in order to make the world of soft body physics more enjoyable for you.
ru: Спасибо за установку Rigs of Rods! В помощь тебе мы подготовили данную документацию, которая откроет для тебя мир физики мягких тел

source: The goal of this Wiki is to deliver help for newcomers, document file formats used by Rigs of Rods to allow content creators to modify and create content for the game and to hold informations for developers.
ru: Цель этой документации - помощь новичкам, описание форматов игры для облегчения моддинга игры и служение опорной точкой при разработке игры.

source: First, *a word of caution*: Rigs of Rods is under heavy development right now. File formats may and will change in the future as well as semantics and physics behavior. Your creation may not work in upcoming versions of Rigs of Rods. *You have been warned.*
ru: *Сразу оговоримся*, что Rigs of Rods сейчас в стадии активной разработки. Файловые форматы, семантика и физика сейчас активно дорабатываются. *Мы не можем гарантировать работу существующих модов в будущем.*

source: Ready to develop? Please select your destination:
ru: Готов к разработке? Поехали:

source: User manual
ru: Руководство пользователя

source: Compiling the game
ru: Сборка игры

source: <<compile-linux/index.adoc#,Compiling on Linux>>
ru: <<compile-linux/index.adoc#,Сборка под Linux>>

source: <<compile-osx/index.adoc#,Compiling on OS X>>
ru: <<compile-osx/index.adoc#,Сборка под OS X>>

source: <<compile-windows/index.adoc#,Compiling on Windows>>
ru: <<compile-windows/index.adoc#,Сборка под Windows>>

source: Configuration
ru: Настройка

source: <<file-formats-and-configuration-files/index.adoc#,File Formats and Configuration Files>>
ru: <<file-formats-and-configuration-files/index.adoc#,Форматы файлов и файлы настройки>>

source: Troubleshooting
ru: Устранение неполадок

source: <<errors/index.adoc#,Error reference>>
ru: <<errors/index.adoc#,Справочник по ошибкам>>

source: Modding reference
ru: Справочник моддера

source: Specifications
ru: Спецификации

source: http://anotherfoxguy.github.io/RoRdocs/[Doxygen documentation (external link)]
ru: http://anotherfoxguy.github.io/RoRdocs/[Документация Doxygen (внешняя ссылка)]

source: <<terrain-system/index.adoc#,Terrain System>>
ru: <<terrain-system/index.adoc#,Система карт>>

source: <<truck-description-file/index.adoc#,Truck Description File, format used for defining vehicle behaviour ingame>>
ru: <<truck-description-file/index.adoc#,Файл описания грузовика _(Truck Description File)_ - формат, используемый для определения поведения транспортных средств>>

source: <<train-documentation/index.adoc#,Train Documentation>>
ru: <<train-documentation/index.adoc#,Документация по ЖД>>

source: <<hydrax-config/index.adoc#,Hydrax Config>>
ru: <<hydrax-config/index.adoc#,Настройки Hydrax>>

source: Tutorials
ru: Обучение

source: <<rorbook/index.adoc#,RoRBook, a comprehensive tutorial that will help you create your own truck, train, vehicle or boat>>
ru: <<rorbook/index.adoc#,Книга RoR, полноценный учебник по созданию транспортного средства>>

source: <<shadows/index.adoc#,Shadows tutorial>>
ru: <<shadows/index.adoc#,Руководство по теням>>

source: Developer pages
ru: Страницы для разработчиков

source: <<terrain-system-ideas/index.adoc#,Ideas for future terrain development>>
ru: <<terrain-system-ideas/index.adoc#,Идеи для разработки системы карт будущего>>
