Repository: DirtGamer301/rigsofrods.github.io
Catalog: content/po/*/docs/hydrax-config/index.adoc.po
Languages: ru

source: Hydrax Config
ru: Настройки Hydrax

source: This file is used to tweak Hydrax's water to your needs.
ru: Этот файл даёт Вам возможность настроить воду Hydrax.

source: A hdx file is a text file, and must have the extension ".hdx". You can have only 1 per "terrn2" file.
ru: HDX-файл - текстовый файл с расширением ".hdx". Допускается не более одного на каждый terrn2-файл.

source: Default
ru: Стандартные настройки

source: #Hydrax cfg file.
ru: #Файл настроек Hydrax.

source: #Hydrax version field HydraxVersion=0.5.4
ru: #Версия Hydrax HydraxVersion=0.5.4

source: #Main options field <float>PlanesError=10.5 <float>FullReflectionDistance=1e+011 <float>GlobalTransparency=0 <float>NormalDistortion=0.075 <vector3>WaterColor=0.0886994x0.204166x0.238806
ru: #Основные настройки <float>PlanesError=10.5 <float>FullReflectionDistance=1e+011 <float>GlobalTransparency=0 <float>NormalDistortion=0.075 <vector3>WaterColor=0.0886994x0.204166x0.238806

source: #Components field Components=Sun|Foam|Depth|Smooth|Caustics|Underwater|UnderwaterReflections|UnderwaterGodRays
ru: #Компоненты Components=Sun|Foam|Depth|Smooth|Caustics|Underwater|UnderwaterReflections|UnderwaterGodRays

source: #Foam parameters <float>FoamMaxDistance=7.5e+006 <float>FoamScale=0.1 <float>FoamStart=0 <float>FoamTransparency=1
ru: #Пена <float>FoamMaxDistance=7.5e+006 <float>FoamScale=0.1 <float>FoamStart=0 <float>FoamTransparency=1

source: #Depth parameters <float>DepthLimit=70 <float>DistLimit=90
ru: #Глубина <float>DepthLimit=70 <float>DistLimit=90

source: #Smooth transitions parameters <float>SmoothPower=5
ru: #Плавный переход <float>SmoothPower=5

source: #Caustics parameters <float>CausticsScale=8.5 <float>CausticsPower=5.5 <float>CausticsEnd=0.7
ru: #Каустика <float>CausticsScale=8.5 <float>CausticsPower=5.5 <float>CausticsEnd=0.7

source: #God rays parameters <vector3>GodRaysExposure=0.76x2.46x2.29 <float>GodRaysIntensity=0.015 <float>GodRaysSpeed=5 <int>GodRaysNumberOfRays=100 <float>GodRaysRaysSize=0.03 <bool>GodRaysIntersections=false
ru: #Лучи Бога <vector3>GodRaysExposure=0.76x2.46x2.29 <float>GodRaysIntensity=0.015 <float>GodRaysSpeed=5 <int>GodRaysNumberOfRays=100 <float>GodRaysRaysSize=0.03 <bool>GodRaysIntersections=false

source: #Rtt quality field(0x0 = Auto) <size>Rtt_Quality_Reflection=0x0 <size>Rtt_Quality_Refraction=0x0 <size>Rtt_Quality_Depth=0x0 <size>Rtt_Quality_URDepth=0x0 <size>Rtt_Quality_GPUNormalMap=0x0
ru: #Качество Rtt(0x0 = Авто) <size>Rtt_Quality_Reflection=0x0 <size>Rtt_Quality_Refraction=0x0 <size>Rtt_Quality_Depth=0x0 <size>Rtt_Quality_URDepth=0x0 <size>Rtt_Quality_GPUNormalMap=0x0

source: #Module options Module=ProjectedGridVertex
ru: #Настройки модулей Module=ProjectedGridVertex

source: #Noise options Noise=Perlin
ru: #Шум Noise=Perlin

source: Custom HDX Config file for your terrain
ru: Особые HDX-настройки для карты

source: As Caelum does, Hydrax also has its own configuration file, which you can customize to fit your requirements.
ru: Как и у Caelum, у Hydrax тоже есть свой файл настроек, который можно подстраивать под свои требования.

source: Simply make a copy of the file found over this section, save it as "your_terrain_name.hdx" and put it in your zip file.
ru: Достаточно скопировать содержимое секции выше, сохранить как "название_карты.hdx" и добавить в zip-файл.

source: Then, in the "terrn2" file, put this:
ru: Затем добавить в terr2-файл следующее:

source: HydraxConfigFile = your_terrain_name.hdx
ru: HydraxConfigFile = название_карты.hdx

source: And you're done!
ru: Готово!

source: For the moment, you can tweak the file by a text editor or use the HydraxEditor (But will look glitched because of the size proportions).
ru: На данный момент с файлом можно работать в текстовом редакторе или HydraxEditor (правда, возможны глюки из-за пропорций)

source: We are planning to make our own Terrain Editor which will give your the possibility to tweak Hydrax in real-time.
ru: В будущем мы планируем создать редактор карт, который даст возможность работы с Hydrax в реальном времени.
