Repository: DirtGamer301/rigsofrods.github.io
Catalog: content/po/*/download/index.adoc.po
Languages: de, ru

source: Download the latest stable release https://github.com/RigsOfRods/rigs-of-rods/releases/latest[here] (recommended)
de: Aktuelle stabile Version https://github.com/RigsOfRods/rigs-of-rods/releases/latest[hier] herunterladen (empfohlen)

source: Preview builds for upcoming versions may be found http://www.rigsofrods.com/forums/172-Development-Discussion[here]
de: Beta Versionen können http://www.rigsofrods.com/forums/172-Development-Discussion[hier] gefunden werden

source: If you want to build from source see http://www.rigsofrods.com/wiki/pages/Compiling_Sources_under_Windows[here]
de: Kompiliere das Spiel selbst: http://www.rigsofrods.com/wiki/pages/Compiling_Sources_under_Windows[Anleitung]

source: Packages for various distributions: http://www.rigsofrods.com/threads/113517-Collection-of-prepuilt-packages-for-various-Linux-distributions[here]
de: Pakete für diverse Linux-Distributionen gibt es http://www.rigsofrods.com/threads/113517-Collection-of-prepuilt-packages-for-various-Linux-distributions[hier]
ru: Пакеты для различных дистрибутивов: http://www.rigsofrods.com/threads/113517-Collection-of-prepuilt-packages-for-various-Linux-distributions[здесь]

source: Build from source, see http://www.rigsofrods.com/wiki/pages/Compiling_Sources_under_Linux[here]
de: Kompiliere das Spiel selber: http://www.rigsofrods.com/wiki/pages/Compiling_Sources_under_Linux[Anleitung]

source: Unfortunately, due to lack of OS X coders, there is no native build of the latest version available.
de: Leider können wir aus Mangel an OS X Entwicklern kein natives Build anbieten.

source: Run the Windows build through Wine: https://github.com/RigsOfRods/rigs-of-rods/releases/latest[Download Windows build] and see http://www.rigsofrods.com/threads/110314-RoR-on-Mac-Picture-Heavy-Works-with-most-versions[Tutorial] (recommended)
de: Spiele das Windows Build mit Wine: https://github.com/RigsOfRods/rigs-of-rods/releases/latest[Windows Build herunterladen] und http://www.rigsofrods.com/threads/110314-RoR-on-Mac-Picture-Heavy-Works-with-most-versions[Anleitung] befolgen (empfohlen)

source: Build from source, see http://www.rigsofrods.com/wiki/pages/Compiling_Sources_under_MacOS[here]
de: Kompiliere das Spiel selber, siehe http://www.rigsofrods.com/wiki/pages/Compiling_Sources_under_MacOS[Anleitung]

source: Notes
de: Bemerkungen

source: The changelog is presented http://www.rigsofrods.com/wiki/pages/Changelog[here].
de: Das Changelog gibt es http://www.rigsofrods.com/wiki/pages/Changelog[hier]

source: Many questions are answered on the Wiki, have a look around: http://www.rigsofrods.com/wiki/[Rigs of Rods Wiki]
de: Viele Fragen werden hier beantwortet: http://www.rigsofrods.com/wiki/[Rigs of Rods Wiki]

source: License
de: Lizenz
ru: Лицензия

source: Rigs of Rods is free and open source software under the GPL v3 license, meaning it is both free as in speech (you can modify it) and free as in beer (it does not cost you anything).
de: Rigs of Rods ist nicht nur kostenlos, sondern auch freie Software. Der Source Code ist unter der GPLv3 lizensiert
ru: Rigs of Rods - свободное программное обеспечение, доступное на условиях лицензии GPLv3.

source: Legacy
de: Geschichte
ru: История

source: If you are interested in Rigs of Rods' history check out the http://sourceforge.net/projects/rigsofrods/files/rigsofrods/museum/[museum]
de: When dich alte Versionen interessieren, schau mal ins http://sourceforge.net/projects/rigsofrods/files/rigsofrods/museum/[Museum]

source: Download
ru: Скачать

source: Builds
ru: Сборки

source: If you want to build from source see <<{baseurl}/docs/compile-windows/index.adoc#,Compiling on Windows>>
ru: Если надо собрать из исходных кодов см. <<{baseurl}/docs/compile-windows/index.adoc#,Сборка под Windows>>

source: Build from source, see <<{baseurl}/docs/compile-linux/index.adoc#,Compiling on Linux>>
ru: Можно собрать из исходных кодов, см. <<{baseurl}/docs/compile-linux/index.adoc#,Сборка под Linux>>

source: Unfortunately, due to lack of OS X coders, there is no up to date build of the latest version available.
ru: К сожалению, в виду отсутствия разработчиков под OS X сборки под эту ОС нет.

source: If you want to build from source see <<{baseurl}/docs/compile-osx/index.adoc#,Compiling on OS X>>
ru: Можно попробовать собрать самостоятельно, см. <<{baseurl}/docs/compile-osx/index.adoc#,Сборка под OS X>>

source: Overview / Readme / FAQ
ru: Обзор / Прочти меня / ЧаВо

source: You can find more information about the latest stable release here: <<release-notes/0.38/index.adoc#,Gaggenau>>
ru: Информация о последнем выпуске здесь: <<release-notes/0.38/index.adoc#,Gaggenau>>

source: The changelog is presented <<changelog/index.adoc#,here>>.
ru: Список изменений <<changelog/index.adoc#,тут>>.

source: Many questions are answered in the documentation, have a look around: <<{baseurl}/docs/index.adoc#,Documentation index>>
ru: Ответы на множество вопросов можно найти в <<{baseurl}/docs/index.adoc#,документации>>

source: If you are interested in Rigs of Rods' history check out the museum http://sourceforge.net/projects/rigsofrods/files/rigsofrods/museum/[here]
ru: Если интересуетесь историей проекта Rigs of Rods, то добро пожаловать в наш http://sourceforge.net/projects/rigsofrods/files/rigsofrods/museum/[музей]
