Repository: DirtGamer301/rigsofrods.github.io
Catalog: blog/po/*/blog/2015-08-04-test-build-5-released/index.adoc.po
Languages: ru

source: title: "Test Build 5 released!"
ru: title: "Релиз тестовой сборки 5!"

source: firstname: "Moncef"
ru: firstname: "Монсеф"

source: lastname: "Ben Slimane"
ru: lastname: "Бен Слимане"

source: tags: ["News", "Development"]
ru: tags: ["Новости", "Разработка"]

source: Test Build 5 released!
ru: Релиз тестовой сборки 5!

source: Key highlights
ru: Основные изменения

source: Added some new wallpapers.
ru: Добавлены новые обои.

source: Improved the parser, even more fault tolerance.
ru: Улучшена отказоустойчивость парсера.

source: Fixed PSSM shadows. (Not perfect but much better than before)
ru: Исправлены PSSM-тени.

source: Fixed Flares that could be activated in Pause Menu.
ru: Исправлены вспышки, активируемые из меню паузы.

source: Fixed beam material using set_beam_defaults.
ru: Исправлен рёберный материал, использующий set_beam_defaults.

source: Fixed bug where beams couldn't be connect to wheel nodes.
ru: Исправлена ошибка соединения рёбер с узлами колёс.

source: Fixed camera views glitch when switching cars.
ru: Исправлена ошибка видов камеры при переключении автомобилей.

source: Fixed crash when removing car in cabin camera.
ru: Исправлено падение на удалении авто при виде из кабины.

source: Fixed creak sounds.
ru: Исправлены звуки скрипа.

source: Feature: Turbo Wastegate and anti-lag simulation. (Sounds need some improvements)
ru: Добавлено: Регулировочный турбо-клапан и анти-лаг-симуляция.

source: This build is now the closest result to what is coming with the release of the 11 August. This is also a Beta build.
ru: По качеству эта сборка близка к релизу 11 августа. Поэтому это ещё и первая бета.

source: Known Issues
ru: Известные ошибки:

source: Trains may still randomly crash when going over a switch if inter-vehicle collision is enabled.
ru: Возможны падения при проезде на поездах ЖД-стрелок

source: Shadows are very FPS-yummy and sometimes conflict with terrain's layers. (E.g.: Auriga, Greece.)
ru: Тени сильно бьют по FPS и иногда портят слои ландшафта. (напр.: Auriga, Греция.)

source: Back to menu is not very stable yet.
ru: Возврат в меню работает нестабильно.

source: Skidmarks have some memory leaks.
ru: Возможны утечки памяти из-за тормозных следов.

source: Ingame mapping not working yet.
ru: Внутриигровой мэппинг не работает.

source: Documentation about how to add shadows to your models/vehicles will be coming soon, for the moment, only in-truck-file managed-materials support shadows and self-shadowing.
ru: В процессе написания находится документация по теням; на данный момент только managed-materials в файле описания грузовика поддерживают тени.

source: How to download:
ru: Скачать:

source: From now on, Rigs of Rods can be updated automatically by a special utility. Download the updater from http://www.rigsofrods.com/threads/120032-Testing-Purposes-Updater-V2[here]. Just put it in any version of the game and it will upgrade Rigs of Rods to the latest release. You can also use the https://yadi.sk/d/OOKjBVzmiJzxs[zip archive].
ru: Доступна программа обновления, её можно скачать http://www.rigsofrods.com/threads/120032-Testing-Purposes-Updater-V2[отсюда]. Она совместима со всеми версиями Rigs of Rods. Также можно обновиться вручную, скачав архив https://yadi.sk/d/OOKjBVzmiJzxs[здесь].

source: This might be the last archived release though, since it is possible to use the updater given with the build.
ru: Возможно, это последний релиз сборки в архиве, впредь можно обновляться с помощью нашей утилиты.
