Repository: DirtGamer301/rigsofrods.github.io
Catalog: blog/po/*/blog/2015-08-04-social-media-feeds/index.adoc.po
Languages: ru

source: title: "Social media feeds"
ru: title: "Мы в социальных сетях"

source: firstname: "Artem"
ru: firstname: "Артём"

source: lastname: "Vorotnikov"
ru: lastname: "Воротников"

source: Development
ru: Разработка

source: Community
ru: Сообщество

source: Social media
ru: Социальные сети

source: Social media feeds
ru: Мы в социальных сетях

source: Hello folks,
ru: Дорогие друзья,

source: Did you know that we have official social media feeds too now?
ru: А вы знаете, что у нас теперь есть страницы в социальных сетях

source: English: https://facebook.com/rigsofrods.official
ru: Английская: https://facebook.com/rigsofrods.official

source: Russian: https://vk.com/rigsofrods.official
ru: Русская: https://vk.com/rigsofrods.official

source: Follow us so you never miss fresh RoR development news.
ru: Подпишитесь и будьте в курсе всех последних новостей разработки RoR.
