Repository: DirtGamer301/rigsofrods.github.io
Catalog: blog/po/*/blog/2015-07-19-test-build-4-released/index.adoc.po
Languages: ru

source: title: "Test Build 4 released!"
ru: title: "Релиз тестовой сборки 4!"

source: firstname: "Moncef"
ru: firstname: "Монсеф"

source: lastname: "Ben Slimane"
ru: lastname: "Бен Слимане"

source: Test Build 4 released!
ru: Релиз тестовой сборки 4!

source: Hello there,
ru: Привет,

source: The blog post is a bit late but oh well.
ru: Запись с небольшим опозданием, эх...

source: We are getting closer and closer to the 0.4.5 release with each test build.
ru: С каждой новой сборкой мы всё ближе и ближе к релизу версии 0.4.5.

source: RoR 0.4.5's release is aimed at 11 August, but who knows? It might come a bit later.
ru: Версия 0.4.5 запланирована на 11 августа, но кто знает? Выпуск может состояться немного позже.

source: Today, Test Build 4 got released!
ru: Представляем тестовую сборку 4.

source: Changelog
ru: Список изменений

source: Added ability to select skidmarks quality.
ru: Добавлен выбор качества тормозных следов.

source: Added flexbody_lods & flexbody_cache_system configs to the ingame options.
ru: Добавлены настройки flexbody_lods и flexbody_cache_system.

source: Added some main menu music. (can be disabled via ingame options)
ru: Немного музыки в главном меню (можно отключить в настройках)

source: Improved overall performances.
ru: Улучшена производительность.

source: Improved Aircraft's GUI
ru: Улучшен интерфейс самолётов и вертолётов.

source: Improved managed materials. (the ones you use on a truck file, are now just a part of it, wiki page to come)
ru: Улучшено управление материалами. (те, что используются TDF-файлом, станут его частью)

source: Improved reflections (thanks to derbymutt)
ru: Улучшены отражения (спасибо derbymutt)

source: Improved the parser, more fault tolerance
ru: Улучшена отказоустойчивость парсера.

source: Removed current PSSM shadows technique, currently not working correctly.
ru: Удалены PSSM-тени, на данный момент не работают.

source: Fixed TB3's cache bug.
ru: Исправлена ошибка кэширования из ТС3.

source: Fixed nodes2 with flexbodies.
ru: Исправлены nodes2 с мягкими телами.

source: Fixed crash 'back to menu' on Linux.
ru: Исправлено падение при возврате в главное меню под Linux.

source: Fixed Hydrax under OpenGL .
ru: Исправлена работа Hydrax на OpenGL.

source: Fixed triggers not extending with commands/commands2.
ru: Исправлена работа триггеров с commands/commands2.

source: Fixed fixes (Nodes who don't move at all)
ru: Исправлены fixes.

source: Fixed flashing flares.
ru: Исправлены вспышки.

source: Fixed Pause Menu bug where mouse don't move when using free camera.
ru: Исправлена ошибка в меню паузы, из-за которой мышь не двигалась при свободной камере.

source: Fixed unlimited sight range.
ru: Исправлена неограниченная дальность обзора.

source: Fixed wallpapers resolution ratio.
ru: Исправлено разрешение обоев.

source: Fixed meshwheels/meshwheels2 parser bug. (Where the comma wasn't working as intended in the mesh file's name)
ru: Исправлена ошибка разбора meshwheels/meshwheels2. (Неправильная обработка запятой в имени mesh-файла)

source: Fixed waves being rendered at wrong height.
ru: Исправлена высота волн.

source: Fixed soundscripts duplicated name makes archive not load.
ru: Исправлена загрузка архивов при дубликатах soundscripts.

source: Feature: More realistic turbo simulation.
ru: Добавлено: Более реалистичная симуляция турбо.

source: Feature: AI now can be scripted using Angelscript, wiki page to come.
ru: Добавлено: ИИ на AngelScript.

source: Feature: Mods are now sorted by alphabetic order.
ru: Добавлено: Сортировка модов по алфавиту.

source: A car that uses the new turbo code: http://www.rigsofrods.com/threads/118984-Lotus-76-1-for-current-and-future-ror-versions-(Updated-for-test-build-4)[Lotus-76-1-for-current-and-future-ror-versions-(Updated-for-test-build-4)]
ru: Авто с новым турбо: http://www.rigsofrods.com/threads/118984-Lotus-76-1-for-current-and-future-ror-versions-(Updated-for-test-build-4)[Lotus-76-1-for-current-and-future-ror-versions-(Updated-for-test-build-4)]

source: Have fun and don't forget to https://github.com/RigsOfRods/rigs-of-rods/issues[report bugs].
ru: Наслаждайтесь и не забудьте https://github.com/RigsOfRods/rigs-of-rods/issues[сообщать нам об ошибках]

source: http://www.rigsofrods.com/threads/119110-Test-Build-Rigs-of-rods-0-4-5-0-dev#post1383984[Download here!]
ru: http://www.rigsofrods.com/threads/119110-Test-Build-Rigs-of-rods-0-4-5-0-dev#post1383984[Скачать тут!]
